In [50]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [3]:
df = pd.read_csv(r"C:\Users\merug\Downloads\final_food_delivery_dataset.csv")
df.head()

,order_id,order_date,total_amount,user_id,name,city,membership,restaurant_id,restaurant_name,restaurant_name_sql,cuisine,rating
0,1,18-02-2023,842.97,2508,User_2508,Hyderabad,Regular,450,New Foods Chinese,Restaurant_450,Mexican,3.2
1,2,18-01-2023,546.68,2693,User_2693,Pune,Regular,309,Ruchi Curry House Multicuisine,Restaurant_309,Indian,4.5
2,3,15-07-2023,163.93,2084,User_2084,Chennai,Gold,107,Spice Kitchen Punjabi,Restaurant_107,Mexican,4.0
3,4,04-10-2023,1155.97,319,User_319,Bangalore,Gold,224,Darbar Kitchen Non-Veg,Restaurant_224,Chinese,4.8
4,5,25-12-2023,1321.91,1064,User_1064,Pune,Regular,293,Royal Eatery South Indian,Restaurant_293,Italian,3.0

In [4]:
df.shape

(10000, 12)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 12 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   order_id             10000 non-null  int64
 1   order_date           10000 non-null  object
 2   total_amount         10000 non-null  float64
 3   user_id              10000 non-null  int64
 4   name                 10000 non-null  object
 5   city                 10000 non-null  object
 6   membership           10000 non-null  object
 7   restaurant_id        10000 non-null  int64
 8   restaurant_name      10000 non-null  object
 9   restaurant_name_sql  10000 non-null  object
 10  cuisine              10000 non-null  object
 11  rating               10000 non-null  float64
dtypes: float64(2), int64(3), object(7)
memory usage: 937.6+ KB

### Which city has the highest total revenue (total_amount) from Gold members?

In [21]:
gold_df = df[df['membership'].str.lower() == 'gold']
gold_df

,order_id,order_date,total_amount,user_id,name,city,membership,restaurant_id,restaurant_name,restaurant_name_sql,cuisine,rating
2,3,15-07-2023,163.93,2084,User_2084,Chennai,Gold,107,Spice Kitchen Punjabi,Restaurant_107,Mexican,4.0
3,4,04-10-2023,1155.97,319,User_319,Bangalore,Gold,224,Darbar Kitchen Non-Veg,Restaurant_224,Chinese,4.8
8,9,05-12-2023,953.30,364,User_364,Chennai,Gold,7,Ruchi Biryani Punjabi,Restaurant_7,Italian,3.2
11,12,27-10-2023,1484.65,884,User_884,Pune,Gold,423,Royal Tiffins Multicuisine,Restaurant_423,Indian,3.2
13,14,24-09-2023,898.24,364,User_364,Chennai,Gold,112,Grand Cafe Punjabi,Restaurant_112,Chinese,3.2
...,...,...,...,...,...,...,...,...,...,...,...,...
9993,9994,28-04-2023,322.54,1616,User_1616,Hyderabad,Gold,198,Annapurna Tiffins North Indian,Restaurant_198,Mexican,4.1
9994,9995,12-11-2023,137.96,1257,User_1257,Bangalore,Gold,328,Ruchi Curry House Andhra,Restaurant_328,Mexican,4.6
9995,9996,21-05-2023,1211.96,2528,User_2528,Hyderabad,Gold,249,Royal Kitchen North Indian,Restaurant_249,Italian,4.7
9997,9998,11-11-2023,979.44,522,User_522,Bangalore,Gold,420,Ruchi Tiffins Chinese,Restaurant_420,Italian,4.0
9998,9999,08-09-2023,1105.93,319,User_319,Bangalore,Gold,492,Swagath Kitchen North Indian,Restaurant_492,Italian,4.0

In [24]:
city_revenue = gold_df.groupby(['city'])['total_amount'].sum().sort_values(ascending=False)
city_revenue

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

### 2. Which cuisine has the highest average order value across all orders?

In [32]:
df.groupby('cuisine')['total_amount'].mean().sort_values(ascending=False)

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

### 3. How many distinct users placed orders worth more than ₹1000 in total (sum of all their orders)?

In [37]:
user_total_spend = df.groupby('user_id')['total_amount'].sum().reset_index()
user_total_spend

      user_id  total_amount
0           1       1289.66
1           2       7564.12
2           3       1839.51
3           4       3741.16
4           5       5742.88
...       ...           ...
2878     2996       1533.54
2879     2997       5310.32
2880     2998       4241.47
2881     2999        643.89
2882     3000       2226.63

[2883 rows x 2 columns]

In [40]:
a = user_total_spend[user_total_spend['total_amount'] > 1000]
a

      user_id  total_amount
0           1       1289.66
1           2       7564.12
2           3       1839.51
3           4       3741.16
4           5       5742.88
...       ...           ...
2877     2995       2472.66
2878     2996       1533.54
2879     2997       5310.32
2880     2998       4241.47
2882     3000       2226.63

[2544 rows x 2 columns]

In [42]:
a['user_id'].nunique()

2544

### 4. Which restaurant rating range generated the highest total revenue?

In [51]:
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ['3.0–3.5', '3.6–4.0', '4.1–4.5', '4.6–5.0']

df['rating_range'] = pd.cut(
    df['rating'],
    bins=bins,
    labels=labels,
    include_lowest=True
)
df.groupby('rating_range')['total_amount'].sum().sort_values(ascending=False)

rating_range
4.6–5.0    2197030.75
3.0–3.5    2136772.70
4.1–4.5    1960326.26
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

### 5. Among Gold members, which city has the highest average order value?

In [53]:
gold_df.groupby('city')['total_amount'].mean().sort_values(ascending=False)

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

### 6. Which cuisine has the lowest number of distinct restaurants but still contributes significant revenue?

In [57]:
cuisine_data = df.groupby('cuisine').agg(
    distinct_restaurants = ('restaurant_id', 'nunique'),
    total_revenue = ('total_amount', 'sum')
)
cuisine_data

         distinct_restaurants  total_revenue
cuisine
Chinese                   120     1930504.65
Indian                    126     1971412.58
Italian                   126     2024203.80
Mexican                   128     2085503.09

In [62]:
median_revuenue = cuisine_data['total_revenue'].median()
median_revuenue

1997808.19

In [64]:
results = cuisine_data[cuisine_data['total_revenue'] >= median_revuenue]
results

         distinct_restaurants  total_revenue
cuisine
Italian                   126     2024203.80
Mexican                   128     2085503.09

In [67]:
results.sort_values('distinct_restaurants').head(1)

         distinct_restaurants  total_revenue
cuisine
Italian                   126      2024203.8

### 7. What percentage of total orders were placed by Gold members? (Rounded to nearest integer)

In [72]:
total_orders = len(df)
gold_orders = len(df[df['membership'].str.lower() == 'gold'])
print(gold_orders)
percentage = round((gold_orders / total_orders) * 100)
print(percentage)

4987
50

### 8. Which restaurant has the highest average order value but less than 20 total orders?

In [78]:
restaurant_stats = df.groupby('restaurant_name').agg(
    total_orders = ('order_id', 'count'),
    avg_order_value = ('total_amount', 'mean')
)
restaurant_stats

                                    total_orders  avg_order_value
restaurant_name
Amma Biryani Family Restaurant                45       799.941556
Amma Biryani North Indian                     57       774.900526
Amma Biryani South Indian                     15       708.708667
Amma Cafe Non-Veg                             24       736.174583
Amma Cafe North Indian                        11       667.979091
...                                          ...              ...
Udupi Mess Pure Veg                           22       768.489091
Udupi Restaurant Family Restaurant            19       796.961053
Udupi Restaurant Pure Veg                     10       895.619000
Udupi Restaurant South Indian                 18       828.162778
Udupi Tiffins Punjabi                         27       914.233704

[433 rows x 2 columns]

In [83]:
result = restaurant_stats[restaurant_stats['total_orders'] < 20].sort_values('avg_order_value', ascending=False)
result

                                   total_orders  avg_order_value
restaurant_name
Hotel Dhaba Multicuisine                     13      1040.222308
Sri Mess Punjabi                             12      1029.180833
Ruchi Biryani Punjabi                        16      1002.140625
Sri Delights Pure Veg                        18       989.467222
Classic Kitchen Family Restaurant            19       973.167895
...                                         ...              ...
Annapurna Tiffins Punjabi                    19       621.828947
Darbar Tiffins Non-Veg                       18       596.815556
Darbar Restaurant Punjabi                    14       589.972857
Spice Tiffins Pure Veg                       15       578.578667
Ruchi Mess Punjabi                           17       572.686471

[170 rows x 2 columns]

In [87]:
result.sort_values('total_orders', ascending=False).head(2)

                                   total_orders  avg_order_value
restaurant_name
Darbar Delights Family Restaurant            19       802.882105
Ruchi Foods Chinese                          19       686.603158

### 9. Which combination contributes the highest revenue?

In [92]:
options = [
    ('Gold', 'Indian'),
    ('Gold', 'Italian'),
    ('Regular', 'Indian'),
    ('Regular', 'Chinese')
]

results = []

for membership, cuisine in options:
    revenue = df[ 
        (df['membership'] == membership) &
        (df['cuisine'] == cuisine)
    ]['total_amount'].sum()
    
    results.append((membership+ " + "+ cuisine, revenue))

results

[('Gold + Indian', 979312.31),
 ('Gold + Italian', 1005779.05),
 ('Regular + Indian', 992100.27),
 ('Regular + Chinese', 952790.9099999999)]

### 10. During which quarter of the year is the total revenue highest?

In [94]:
df['order_date'] = pd.to_datetime(df['order_date'])

In [96]:
df.groupby(df['order_date'].dt.quarter)['total_amount'].sum()
# here 3rd quarter means jul-sep

order_date
1    2010626.64
2    1945348.72
3    2037385.10
4    2018263.66
Name: total_amount, dtype: float64

### 11. How many total orders were placed by users with Gold membership?

In [97]:
len(gold_df)

4987

### 12. What is the total revenue (rounded to nearest integer) generated from orders placed in Hyderabad city?

In [101]:
round(df[df['city'] == 'Hyderabad']['total_amount'].sum())

1889367

### 13. How many distinct users placed at least one order?

In [102]:
df['user_id'].nunique()

2883

### 14. What is the average order value (rounded to 2 decimals) for Gold members?

In [109]:
round(gold_df['total_amount'].mean(), 2)

797.15

In [108]:
df[df['membership'] == 'Gold']['total_amount'].mean()

797.1455564467616

### 15. How many orders were placed for restaurants with rating ≥ 4.5?

In [113]:
df[df['rating'] >= 4.5].shape[0]

3374

### 16. How many orders were placed in the top revenue city among Gold members only?

In [118]:
gold_df.groupby('city').agg(
    total_orders = ('order_id', 'count'),
    revenue = ('total_amount', 'sum')
).sort_values('revenue', ascending=False).head(1)

         total_orders     revenue
city
Chennai          1337  1080909.79

In [119]:
len(df)

10000

In [120]:
df.shape

(10000, 13)